import React, { Component } from "react";

export default class Spinner extends Component {
    getQuote() {
        const quotes = [
            "兴趣是创造一个欢乐和光明的教学环境的只要途径之一",
            "反思是重要的数学活动，它是数学活动的核心和动力",
            "最精湛的教学艺术，遵循的最高准则就是让学生提问题",
            "教学的艺术不在于传授本领，而在于激励、唤醒和鼓舞",
            "学习的最大动力，是对学习材料的兴趣",
            "使学生对一门学科有兴趣的最好办法势必使之知道这门学科是值得学习的",
            "如果学习只在模仿，那么我们就不会有科学，就不会有技术",
            "教育的最高目标不是知识而是行动",
            "一个受了不良教育影响的孩童等于走失了方向",
            "真正的教师，不允许以自己个人的影响去影响学生",
            "教育的意旨并非知识的累积，而是心智上的能力的发育",
            "一个好的教师，是一个懂得心理学和教育学的人",
            "思想是根基，理想是嫩绿的芽胚，在这上面生长出人类的思想、活动、行为、热情、激情的大树",
            "一个无任何特色的教师，他教育的学生不会有任何特色",
            "没有情感，道德就会变成枯燥无味的空话，只能培养出伪君子",
            "保持和培养每个学生的自尊心，取决于教师如何看待学生的个人学习成绩",
            "知识不是天赋的",
            "教育乃是社会生活延续的工具",
            "学校要求教师在他的本职工作上成为一种艺术家",
            "使学生对教师尊敬的惟一源泉在于教师的德和才",
            "要把学生造就成一种什么人，自己就应当是什么人",
            "做老师的只要有一次向学生撒谎撒漏了底，就可能使他的全部教育成果从此为之毁灭",
            "教师个人的范例，对于青年人的心灵，是任何东西都不可能代替的最有用的阳光",
            "教师的人格就是教育工作者的一切，只有健康的心灵才有健康的行为",
            "教育工作中的百分之一的废品，就会使国家遭受严重的损失",
            "精神的浩瀚，想象的活跃，心灵的勤奋，就是天才",
            "教育的根是苦的，但其果实是甜的",
            "学问是富贵者的装饰，贫困者的避难所，老年人的粮食",
            "在科学上进步而道义上落后的人，不是前进，而是后退",
            "人类所需要的知识有三：理论、实用、鉴别",
            "在教育上，实践必先于理论，而身体的训练须在智力训练之先",
            "教育是约束和指导青少年，培养他们正当的理智",
            "每个人最初所受教育的方向容易决定以后行为的性质，感召的力量是不小的",
            "不知道自己的无知，乃是双倍的无知",
            "子女教育是社会的基础",
            "逆境是磨练人的最高学府",
            "我比别知道得多的，不过是我知道自己的无知",
            "凡是生而为人的人都有受教育的必要",
            "假如要去形成一个人，那便必需由教育去形成",
            "学校是造就人的工场",
            "教师应该是道德卓异的的优秀人物",
            "耐心去打开潜在学生身上的知识泉源",
            "学生之所以善恶学问，原因在教员自己身上",
            "社会的改造要依靠教育的改造",
            "只要把学校和生活联系起来，那么一切的学科就必然地相互联系起来",
            "一切教育的最终目的是形成人格",
            "失败是一种教育，知道什么叫思考的人，不管他是成功或失败，都能学到很多东西",
            "教育的目的在于使人能够继续教育自己",
            "一个人离开学校之后，教育不应停止",
            "社会就是书，事实就是教材",
            "人类的目的是多方面的，教师所关心的也应该是多方面的",
        ];
        return quotes[Math.ceil(Math.random() * (quotes.length - 1))];
    }

    render() {
        return (
            <div className="page-primary bg-gradient-to-br text-white bg-indigo-800 from-indigo-600 via-indigo-800 to-indigo-900 flex flex-col items-center justify-center">
                <svg
                    className="py-2 w-16 h-16 text-gray-200 animate-spin fill-indigo-500"
                    viewBox="0 0 100 101"
                    xmlns="http://www.w3.org/2000/svg"
                >
                    <path
                        d="M100 50.5908C100 78.2051 77.6142 100.591 50 100.591C22.3858 100.591 0 78.2051 0 50.5908C0 22.9766 22.3858 0.59082 50 0.59082C77.6142 0.59082 100 22.9766 100 50.5908ZM9.08144 50.5908C9.08144 73.1895 27.4013 91.5094 50 91.5094C72.5987 91.5094 90.9186 73.1895 90.9186 50.5908C90.9186 27.9921 72.5987 9.67226 50 9.67226C27.4013 9.67226 9.08144 27.9921 9.08144 50.5908Z"
                        fill="currentColor"
                    />
                    <path
                        d="M93.9676 39.0409C96.393 38.4038 97.8624 35.9116 97.0079 33.5539C95.2932 28.8227 92.871 24.3692 89.8167 20.348C85.8452 15.1192 80.8826 10.7238 75.2124 7.41289C69.5422 4.10194 63.2754 1.94025 56.7698 1.05124C51.7666 0.367541 46.6976 0.446843 41.7345 1.27873C39.2613 1.69328 37.813 4.19778 38.4501 6.62326C39.0873 9.04874 41.5694 10.4717 44.0505 10.1071C47.8511 9.54855 51.7191 9.52689 55.5402 10.0491C60.8642 10.7766 65.9928 12.5457 70.6331 15.2552C75.2735 17.9648 79.3347 21.5619 82.5849 25.841C84.9175 28.9121 86.7997 32.2913 88.1811 35.8758C89.083 38.2158 91.5421 39.6781 93.9676 39.0409Z"
                        fill="currentFill"
                    />
                </svg>
                <h2 className="py-2 text-center text-xl font-bold">
                    马上加载完成...
                </h2>
                <i className="px-14 text-center">{this.getQuote()}</i>
            </div>
        );
    }
}
